app/controllers/api/posts_controller.rb

    def create
        @post = Post.new(post_params)

        if @post.save
---
INSERT INTO "posts" ("author_id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 4], ["title", "yoo"], ["body", "it worked"], ["created_at", "2022-06-27 00:13:38.377625"], ["updated_at", "2022-06-27 00:13:38.377625"]]

    def update
        @post = Post.find(params[:id])

        if @post.author_id == current_user.id

            if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "44ree"], ["body", "rre"], ["updated_at", "2022-06-27 03:43:22.473544"], ["id", 59]]

    def destroy
        @Post = Post.find(params[:id])

        if @Post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 37]]