app/controllers/api/users_controller.rb

      def create
        @user = User.new(user_params)
        @user.avatar.attach(io: File.open("app/assets/images/default_batman.png"), filename: "default_batman.png")
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

      def update
        @user = User.find(params[:id])



         puts(params)

        if params[:avatar] != nil

          @user.avatar.attach(params[:avatar])

        end

        if params[:cover] != nil

          @user.cover.attach(params[:cover])

        end

         if @user.save!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2022-06-25 18:08:39.430089"], ["id", 4]]